/* 1
Дана последовательность из n элементов. Определить количество элементов
меньше нуля. */

using System;
class Zadachaodin {
  static void Main() {
      int n = Convert.ToInt32(Console.ReadLine()), kolvo = 0;
    Console.WriteLine(kolvo);
  }
}
